app/controllers/posts_controller.rb

INSERT INTO "posts" ("Author_name", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Author_name", "Eric"], ["body", "Nigeria must survive"], ["user_id", 1], ["created_at", "2020-11-29 21:37:00.156158"], ["updated_at", "2020-11-29 21:37:00.156158"]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save