app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["email", ""], ["password", ""], ["created_at", "2020-11-29 13:19:39.857149"], ["updated_at", "2020-11-29 13:19:39.857149"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Eric"], ["encrypted_password", "$2a$12$jNFXXM/6.vOWIxeBS2etN.oBBWaMmmYAIZIJox4HDSvY4HQxXrjiG"], ["updated_at", "2020-11-29 18:49:57.592004"], ["id", 1]]